<section>
  <div class="msg">
    <p>Вы - невозможно великий путешественник.
       Вы пытаетесь достигнуть того самого места, куда глаза глядят,
       но оно постоянно ускользает от вас. 
       Вдруг перед вами появляется огромное плоское бревно (доска в простонародье)
       и говорит: "Путник, дальше можно пройти только с флагом!"</p>
  </div>
  <div class="msg">
    <p>Ваш путь начинается здесь. Ваша задача - найти флаг.</p>
    <p>Но очень важно, чтобы вы знали, как он выглядит.</p>
  </div>
  <div class="msg">
    <p>Он будет помечен словом <strong>flag</strong>.</p>
    <p>Серьёзно!</p>
    <p>Но для начала вам нужно собрать все предметы, которые указаны внизу страницы.</p>
    <form action="" method="post">
      <input placeholder="Сюда вставьте флаг" name="flag">
      <button>Предъявить флаг</button>
    </form>
  </div>

</section>

<section>
  <a href="{{.Link}}">В добрый путь</a>
</section>

